In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('dados_vendas.csv')
df

,id,data,nome_cliente,cpf,produto,quantidade,valor_total
0,1,2021-01-01,Alice,111.111.111-11,Produto A,1,10.0
1,2,2021-01-02,Bob,222.222.222-22,Produto B,2,40.0
2,3,2021-02-01,Clara,333.333.333-33,Produto A,3,30.0
3,4,2021-02-02,David,444.444.444-44,Produto B,4,80.0
4,5,2021-02-03,Eva,555.555.555-55,Produto C,5,150.0

#### Safrar

In [3]:
df.dtypes

id                int64
data             object
nome_cliente     object
cpf              object
produto          object
quantidade        int64
valor_total     float64
dtype: object

In [6]:
df['data'] = pd.to_datetime(df['data'])
df.dtypes

id                       int64
data            datetime64[ns]
nome_cliente            object
cpf                     object
produto                 object
quantidade               int64
valor_total            float64
dtype: object

In [11]:
formato_safra = lambda data: data.strftime('%y%m')
df['safra'] = df['data'].apply(formato_safra)
df

,id,data,nome_cliente,cpf,produto,quantidade,valor_total,safra
0,1,2021-01-01,Alice,111.111.111-11,Produto A,1,10.0,2101
1,2,2021-01-02,Bob,222.222.222-22,Produto B,2,40.0,2101
2,3,2021-02-01,Clara,333.333.333-33,Produto A,3,30.0,2102
3,4,2021-02-02,David,444.444.444-44,Produto B,4,80.0,2102
4,5,2021-02-03,Eva,555.555.555-55,Produto C,5,150.0,2102

In [17]:
for safra in df['safra'].unique():
    df_temp = df[df['safra'] == safra]
    df_temp.to_csv(f'dados_venda_{safra}.csv', index=False)

In [19]:
df_jan = pd.read_csv('dados_venda_2101.csv')
df_jan

,id,data,nome_cliente,cpf,produto,quantidade,valor_total,safra
0,1,2021-01-01,Alice,111.111.111-11,Produto A,1,10.0,2101
1,2,2021-01-02,Bob,222.222.222-22,Produto B,2,40.0,2101

In [20]:
df_jan = pd.read_csv('dados_venda_2102.csv')
df_jan

,id,data,nome_cliente,cpf,produto,quantidade,valor_total,safra
0,3,2021-02-01,Clara,333.333.333-33,Produto A,3,30.0,2102
1,4,2021-02-02,David,444.444.444-44,Produto B,4,80.0,2102
2,5,2021-02-03,Eva,555.555.555-55,Produto C,5,150.0,2102

##### Exerc√≠cio
Partindo de dados_vendas.csv:
- Crie a Tabela Cliente
- Crie a Tabela Produto
- Crie a Tabela Pedido

In [22]:
import numpy as np

notas_provas = pd.DataFrame({
    'nome': ['A', 'B', 'C', 'D', 'E'],
    'nota': [85, np.nan, 95, 78, np.nan]
})
notas_provas

  nome  nota
0    A  85.0
1    B   NaN
2    C  95.0
3    D  78.0
4    E   NaN

In [24]:
notas_provas['nota'].interpolate()

0    85.0
1    90.0
2    95.0
3    78.0
4    78.0
Name: nota, dtype: float64

#### Metadados de documentos

In [25]:
dados = {
    'data': ['2024-01-01', '2024-01-02'],
    'titulo': ['Primeiro Artigo', 'Segundo Artigo'],
    'autor': ['Autor 1', 'Autor 2'],
    'texto':[
        '''On Windows, if secs is zero.
        the thread relinquishes the remainder of its time slice to any other thread that is ready to run.''',
        '''The following directives can be embedded in the format string.
        They are shown without the optional field width and precision specification.'''
    ]
}

df_artigos = pd.DataFrame(dados)
df_artigos

,data,titulo,autor,texto
0,2024-01-01,Primeiro Artigo,Autor 1,"On Windows, if secs is zero.\n the thre..."
1,2024-01-02,Segundo Artigo,Autor 2,The following directives can be embedded in th...

In [26]:
def contador_palavras(texto):
    return len(texto.split())

contador_palavras('teste 1 2 3')

4

In [27]:
df_artigos['qtde_palavras'] = df_artigos['texto'].apply(contador_palavras)
df_artigos

,data,titulo,autor,texto,qtde_palavras
0,2024-01-01,Primeiro Artigo,Autor 1,"On Windows, if secs is zero.\n the thre...",24
1,2024-01-02,Segundo Artigo,Autor 2,The following directives can be embedded in th...,21

In [ ]:
def contador_frases(texto):
    pass

In [ ]:
def comprimento_medio_palavras(texto):
    pass

In [ ]:
def comprimento_medio_frases(texto):
    pass

In [ ]:
def contagem_paragrafos(texto):
    pass

In [ ]:
def contagem_caracteres(texto):
    pass

In [ ]:
def diversidade_palavras(texto):
    pass